<a href="https://colab.research.google.com/github/tatianaportsova/DS-Unit-1-Sprint-1-Data-Wrangling-and-Storytelling/blob/master/Tatiana_Portsova.LS_DS_113_Join_and_Reshape_Data_Assignment.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [11]:
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*vYGFQCafJtGBBX5mbl0xyw.png'
example = Image(url=url, width=600)

display(example)

In [12]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2020-01-15 23:22:31--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.185.117
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.185.117|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  32.5MB/s    in 6.4s

2020-01-15 23:22:38 (30.6 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [13]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [14]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01/instacart_2017_05_01

In [15]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [18]:
# I don't need anything in the aisles
aisles = pd.read_csv('aisles.csv')
print(aisles.shape)
aisles.head()

(134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [21]:
# I don't need anything in the departments
departments = pd.read_csv('departments.csv')
print(departments.shape)
departments.head()

(21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [22]:
# I'm going to need product_id,	add_to_cart_order
order_products__prior = pd.read_csv('order_products__prior.csv')
print(order_products__prior.shape)
order_products__prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [23]:
# I'm going to need product_id, add_to_cart_order
order_products__train = pd.read_csv('order_products__train.csv')
print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [24]:
# I don't need anything in the orders
orders = pd.read_csv('orders.csv')
print(orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [25]:
# I'm going to need product_name
products = pd.read_csv('products.csv')
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [26]:
# Concatenate order_products__prior and order_products__train
order_products = pd.concat([order_products__prior, order_products__train])

print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
# I'm going to need product_id, add_to_cart_order, product_name

In [0]:
import pandas as pd

In [33]:
condition = (products['product_name'] == 'Banana')|(products['product_name'] == 'Bag of Organic Bananas')|(products['product_name'] == 'Organic Strawberries')|(products['product_name'] == 'Organic Baby Spinach')|(products['product_name'] == 'Organic Hass Avocado')|(products['product_name'] == 'Organic Avocado')|(products['product_name'] == 'Large Lemon')|(products['product_name'] == 'Strawberries')|(products['product_name'] == 'Limes')|(products['product_name'] == 'Organic Whole Milk')

products_subset = products[condition]

print(products_subset.shape)
products_subset.head(10)

(10, 4)

       product_id            product_name  aisle_id  department_id
13175       13176  Bag of Organic Bananas        24              4
16796       16797            Strawberries        24              4
21136       21137    Organic Strawberries        24              4
21902       21903    Organic Baby Spinach       123              4
24851       24852                  Banana        24              4
26208       26209                   Limes        24              4
27844       27845      Organic Whole Milk        84             16
47208       47209    Organic Hass Avocado        24              4
47625       47626             Large Lemon        24              4
47765       47766         Organic Avocado        24              4

In [34]:
# Filtering down the the order_products dataframe

condition1 = (order_products['product_id'] == 13176) | (order_products['product_id'] == 16797) | (order_products['product_id'] == 21137) | (order_products['product_id'] == 21903) | (order_products['product_id'] == 24852) | (order_products['product_id'] == 26209) | (order_products['product_id'] == 27845) | (order_products['product_id'] == 47209) | (order_products['product_id'] == 47626) | (order_products['product_id'] == 47766)  
order_products_subset = order_products[condition1]

print(order_products_subset.shape)
order_products_subset.head(11)

(2418314, 4)

     order_id  product_id  add_to_cart_order  reordered
12          3       21903                  4          1
30          5       13176                  1          1
51          5       47209                 22          0
77         10       24852                  1          1
80         10       47766                  4          1
83         10       21137                  7          1
126        14       27845                  2          1
170        18       47766                 27          1
180        20       24852                  6          0
190        22       24852                  3          1
206        23       47766                  5          1

In [35]:
# on = The column header for the unique identifier column that I'm using to 
# match the two dataframes' information

# how = The way that I want any non-matching rows to be retained or not retained
# Which NaNs should be kept vs dropped
orders_and_products = pd.merge(products_subset, 
                               order_products_subset, 
                               on='product_id', 
                               how='outer')

# inner = do the merge, but drop any rows with NaNs
# outer = do the merge, but keep all the rows even the ones with NaNs
# right = do the merge, but only keep the rows with Nans that came from the 
# right-hand dataframe
# left = do the merge, but only keep the rows with Nans that came from the 
# left-hand dataframe

orders_and_products.head(11)

    product_id            product_name  ...  add_to_cart_order  reordered
0        13176  Bag of Organic Bananas  ...                  1          1
1        13176  Bag of Organic Bananas  ...                  1          1
2        13176  Bag of Organic Bananas  ...                  3          1
3        13176  Bag of Organic Bananas  ...                  3          1
4        13176  Bag of Organic Bananas  ...                  3          1
5        13176  Bag of Organic Bananas  ...                  6          1
6        13176  Bag of Organic Bananas  ...                  4          1
7        13176  Bag of Organic Bananas  ...                  5          1
8        13176  Bag of Organic Bananas  ...                  1          1
9        13176  Bag of Organic Bananas  ...                  1          1
10       13176  Bag of Organic Bananas  ...                 12          0

[11 rows x 7 columns]

In [36]:
orders_and_products.shape

(2418314, 7)

In [37]:
# Remove columns that I don't need

orders_and_products = orders_and_products.drop(['aisle_id', 
                                                'department_id', 
                                                'order_id',
                                                'reordered'], 
                                                axis=1)

orders_and_products.head(11)

    product_id            product_name  add_to_cart_order
0        13176  Bag of Organic Bananas                  1
1        13176  Bag of Organic Bananas                  1
2        13176  Bag of Organic Bananas                  3
3        13176  Bag of Organic Bananas                  3
4        13176  Bag of Organic Bananas                  3
5        13176  Bag of Organic Bananas                  6
6        13176  Bag of Organic Bananas                  4
7        13176  Bag of Organic Bananas                  5
8        13176  Bag of Organic Bananas                  1
9        13176  Bag of Organic Bananas                  1
10       13176  Bag of Organic Bananas                 12

In [38]:
orders_and_products

         product_id            product_name  add_to_cart_order
0             13176  Bag of Organic Bananas                  1
1             13176  Bag of Organic Bananas                  1
2             13176  Bag of Organic Bananas                  3
3             13176  Bag of Organic Bananas                  3
4             13176  Bag of Organic Bananas                  3
...             ...                     ...                ...
2418309       47766         Organic Avocado                  1
2418310       47766         Organic Avocado                  4
2418311       47766         Organic Avocado                 20
2418312       47766         Organic Avocado                  9
2418313       47766         Organic Avocado                 10

[2418314 rows x 3 columns]

In [39]:
orders_and_products['product_name'].value_counts(dropna = False)

Banana                    491291
Bag of Organic Bananas    394930
Organic Strawberries      275577
Organic Baby Spinach      251705
Organic Hass Avocado      220877
Organic Avocado           184224
Large Lemon               160792
Strawberries              149445
Limes                     146660
Organic Whole Milk        142813
Name: product_name, dtype: int64

In [41]:
# How many times was 'Banana' ordered?
condition1 = (orders_and_products['product_name'] == 'Banana')

orders_and_products[condition1]

         product_id product_name  add_to_cart_order
1071657       24852       Banana                  1
1071658       24852       Banana                  6
1071659       24852       Banana                  3
1071660       24852       Banana                  2
1071661       24852       Banana                  2
...             ...          ...                ...
1562943       24852       Banana                  2
1562944       24852       Banana                  6
1562945       24852       Banana                  5
1562946       24852       Banana                  9
1562947       24852       Banana                  1

[491291 rows x 3 columns]

In [44]:
sum(orders_and_products[condition1]['add_to_cart_order'])

2405664

In [45]:
# How many times was 'Bag of Organic Bananas' ordered?
condition2 = (orders_and_products['product_name'] == 'Bag of Organic Bananas')

orders_and_products[condition2]

        product_id            product_name  add_to_cart_order
0            13176  Bag of Organic Bananas                  1
1            13176  Bag of Organic Bananas                  1
2            13176  Bag of Organic Bananas                  3
3            13176  Bag of Organic Bananas                  3
4            13176  Bag of Organic Bananas                  3
...            ...                     ...                ...
394925       13176  Bag of Organic Bananas                  8
394926       13176  Bag of Organic Bananas                  1
394927       13176  Bag of Organic Bananas                  1
394928       13176  Bag of Organic Bananas                  3
394929       13176  Bag of Organic Bananas                 12

[394930 rows x 3 columns]

In [46]:
sum(orders_and_products[condition2]['add_to_cart_order'])

2007396

In [47]:
# How many times was 'Organic Strawberries' ordered?
condition3 = (orders_and_products['product_name'] == 'Organic Strawberries')

orders_and_products[condition3]

        product_id          product_name  add_to_cart_order
544375       21137  Organic Strawberries                  7
544376       21137  Organic Strawberries                  3
544377       21137  Organic Strawberries                  8
544378       21137  Organic Strawberries                  8
544379       21137  Organic Strawberries                 20
...            ...                   ...                ...
819947       21137  Organic Strawberries                  5
819948       21137  Organic Strawberries                 23
819949       21137  Organic Strawberries                  2
819950       21137  Organic Strawberries                  9
819951       21137  Organic Strawberries                  5

[275577 rows x 3 columns]

In [48]:
sum(orders_and_products[condition3]['add_to_cart_order'])

2005999

In [49]:
# How many times was 'Organic Baby Spinach' ordered?
condition4 = (orders_and_products['product_name'] == 'Organic Baby Spinach')

orders_and_products[condition4]

         product_id          product_name  add_to_cart_order
819952        21903  Organic Baby Spinach                  4
819953        21903  Organic Baby Spinach                  6
819954        21903  Organic Baby Spinach                  3
819955        21903  Organic Baby Spinach                  4
819956        21903  Organic Baby Spinach                  8
...             ...                   ...                ...
1071652       21903  Organic Baby Spinach                  3
1071653       21903  Organic Baby Spinach                 11
1071654       21903  Organic Baby Spinach                  1
1071655       21903  Organic Baby Spinach                  8
1071656       21903  Organic Baby Spinach                  7

[251705 rows x 3 columns]

In [50]:
sum(orders_and_products[condition4]['add_to_cart_order'])

1870623

In [51]:
# How many times was 'Organic Hass Avocado' ordered?
condition5 = (orders_and_products['product_name'] == 'Organic Hass Avocado')

orders_and_products[condition5]

         product_id          product_name  add_to_cart_order
1852421       47209  Organic Hass Avocado                 22
1852422       47209  Organic Hass Avocado                 12
1852423       47209  Organic Hass Avocado                  3
1852424       47209  Organic Hass Avocado                  7
1852425       47209  Organic Hass Avocado                  6
...             ...                   ...                ...
2073293       47209  Organic Hass Avocado                  2
2073294       47209  Organic Hass Avocado                  2
2073295       47209  Organic Hass Avocado                  1
2073296       47209  Organic Hass Avocado                 19
2073297       47209  Organic Hass Avocado                  4

[220877 rows x 3 columns]

In [52]:
sum(orders_and_products[condition5]['add_to_cart_order'])

1497887

In [53]:
# How many times was 'Organic Avocado' ordered?
condition6 = (orders_and_products['product_name'] == 'Organic Avocado')

orders_and_products[condition6]

         product_id     product_name  add_to_cart_order
2234090       47766  Organic Avocado                  4
2234091       47766  Organic Avocado                 27
2234092       47766  Organic Avocado                  5
2234093       47766  Organic Avocado                  8
2234094       47766  Organic Avocado                  7
...             ...              ...                ...
2418309       47766  Organic Avocado                  1
2418310       47766  Organic Avocado                  4
2418311       47766  Organic Avocado                 20
2418312       47766  Organic Avocado                  9
2418313       47766  Organic Avocado                 10

[184224 rows x 3 columns]

In [54]:
sum(orders_and_products[condition6]['add_to_cart_order'])

1187054

In [55]:
# How many times was 'Large Lemon' ordered?
condition7 = (orders_and_products['product_name'] == 'Large Lemon')

orders_and_products[condition7]

         product_id product_name  add_to_cart_order
2073298       47626  Large Lemon                  6
2073299       47626  Large Lemon                 13
2073300       47626  Large Lemon                  9
2073301       47626  Large Lemon                  3
2073302       47626  Large Lemon                 12
...             ...          ...                ...
2234085       47626  Large Lemon                  6
2234086       47626  Large Lemon                  8
2234087       47626  Large Lemon                 10
2234088       47626  Large Lemon                 17
2234089       47626  Large Lemon                  6

[160792 rows x 3 columns]

In [56]:
sum(orders_and_products[condition7]['add_to_cart_order'])

1279007

In [57]:
# How many times was 'Strawberries' ordered?
condition8 = (orders_and_products['product_name'] == 'Strawberries')

orders_and_products[condition8]

        product_id  product_name  add_to_cart_order
394930       16797  Strawberries                  1
394931       16797  Strawberries                  5
394932       16797  Strawberries                  7
394933       16797  Strawberries                  1
394934       16797  Strawberries                  1
...            ...           ...                ...
544370       16797  Strawberries                  7
544371       16797  Strawberries                  7
544372       16797  Strawberries                  6
544373       16797  Strawberries                 10
544374       16797  Strawberries                  8

[149445 rows x 3 columns]

In [58]:
sum(orders_and_products[condition8]['add_to_cart_order'])

1065577

In [59]:
# How many times was 'Limes' ordered?
condition9 = (orders_and_products['product_name'] == 'Limes')

orders_and_products[condition9]

         product_id product_name  add_to_cart_order
1562948       26209        Limes                  4
1562949       26209        Limes                  8
1562950       26209        Limes                 10
1562951       26209        Limes                  2
1562952       26209        Limes                 10
...             ...          ...                ...
1709603       26209        Limes                  3
1709604       26209        Limes                  2
1709605       26209        Limes                  6
1709606       26209        Limes                 22
1709607       26209        Limes                 20

[146660 rows x 3 columns]

In [60]:
sum(orders_and_products[condition9]['add_to_cart_order'])

1261016

In [61]:
# How many times was 'Organic Whole Milk' ordered?
condition10 = (orders_and_products['product_name'] == 'Organic Whole Milk')

orders_and_products[condition10]

         product_id        product_name  add_to_cart_order
1709608       27845  Organic Whole Milk                  2
1709609       27845  Organic Whole Milk                  2
1709610       27845  Organic Whole Milk                  2
1709611       27845  Organic Whole Milk                 18
1709612       27845  Organic Whole Milk                 10
...             ...                 ...                ...
1852416       27845  Organic Whole Milk                 17
1852417       27845  Organic Whole Milk                  3
1852418       27845  Organic Whole Milk                 10
1852419       27845  Organic Whole Milk                 12
1852420       27845  Organic Whole Milk                  7

[142813 rows x 3 columns]

In [62]:
sum(orders_and_products[condition10]['add_to_cart_order'])

777566

## Reshape Data Section

- Replicate the lesson code. Remember, if you haven't followed along typing out what we did during lecture, do that now to get more repetition with the syntax.
- Take table 2 (the transpose of table 1) and practice changing it into Tidy format and back again. You should not use the transpose operation anywhere in this code:
 - Table 2 --> Tidy
 - Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [191]:
import pandas as pd
import numpy as np

table1 = pd.DataFrame(
    [[np.nan, 2],
     [16,    11], 
     [3,      1]],
    index=['John Smith', 'Jane Doe', 'Mary Johnson'], 
    columns=['treatmenta', 'treatmentb'])

table2 = table1.T

table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [192]:
# table2 -> tidy
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [193]:
table2 = table2.reset_index()
table2.head()

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [194]:
tidy2 = table2.melt(id_vars = ['John Smith','Jane Doe','Mary Johnson'])

tidy2

   John Smith  Jane Doe  Mary Johnson variable       value
0         NaN      16.0           3.0    index  treatmenta
1         2.0      11.0           1.0    index  treatmentb

In [195]:
tidy2 = table2.melt(id_vars='index')

tidy2

        index      variable  value
0  treatmenta    John Smith    NaN
1  treatmentb    John Smith    2.0
2  treatmenta      Jane Doe   16.0
3  treatmentb      Jane Doe   11.0
4  treatmenta  Mary Johnson    3.0
5  treatmentb  Mary Johnson    1.0

In [196]:
# rename columns

tidy2 = tidy2.rename(columns={
    'index': 'trt', 
    'variable': 'name', 
    'value': 'result'
})
tidy2

          trt          name  result
0  treatmenta    John Smith     NaN
1  treatmentb    John Smith     2.0
2  treatmenta      Jane Doe    16.0
3  treatmentb      Jane Doe    11.0
4  treatmenta  Mary Johnson     3.0
5  treatmentb  Mary Johnson     1.0

In [197]:
# Re-order Columns
tidy2 = tidy2[['name','trt','result']]
tidy2

           name         trt  result
0    John Smith  treatmenta     NaN
1    John Smith  treatmentb     2.0
2      Jane Doe  treatmenta    16.0
3      Jane Doe  treatmentb    11.0
4  Mary Johnson  treatmenta     3.0
5  Mary Johnson  treatmentb     1.0

In [198]:
tidy2.trt = tidy2.trt.str.replace('treatment', '')

tidy2

           name trt  result
0    John Smith   a     NaN
1    John Smith   b     2.0
2      Jane Doe   a    16.0
3      Jane Doe   b    11.0
4  Mary Johnson   a     3.0
5  Mary Johnson   b     1.0

In [201]:
# tidy -> table2

wide = tidy2.pivot_table(index='name', columns='trt', values='result')

wide

trt              a     b
name
Jane Doe      16.0  11.0
John Smith     NaN   2.0
Mary Johnson   3.0   1.0

Load seaborn's flights dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
# Flights Pivot Table

In [0]:
import seaborn as sns

In [0]:
flights = sns.load_dataset('flights')

In [221]:
flights.shape

(144, 3)

In [222]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [223]:
con = (flights['year'] == 1960)

flights[con]

     year      month  passengers
132  1960    January         417
133  1960   February         391
134  1960      March         419
135  1960      April         461
136  1960        May         472
137  1960       June         535
138  1960       July         622
139  1960     August         606
140  1960  September         508
141  1960    October         461
142  1960   November         390
143  1960   December         432

In [230]:
flights.pivot_table(index='year', columns='month', aggfunc=np.mean)

      passengers                       ...
month    January February March April  ... September October November December
year                                   ...
1949         112      118   132   129  ...       136     119      104      118
1950         115      126   141   135  ...       158     133      114      140
1951         145      150   178   163  ...       184     162      146      166
1952         171      180   193   181  ...       209     191      172      194
1953         196      196   236   235  ...       237     211      180      201
1954         204      188   235   227  ...       259     229      203      229
1955         242      233   267   269  ...       312     274      237      278
1956         284      277   317   313  ...       355     306      271      306
1957         315      301   356   348  ...       404     347      305      336
1958         340      318   362   348  ...       404     359      310      337
1959         360      342   406   396  ...       463     407      362      405
1960         417      391   419   461  ...       508     461      390      432

[12 rows x 12 columns]

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
##### YOUR CODE HERE #####

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####